Revit 2024 API
MEPSpaceConstruction.DeleteConstruction Method
Remove an existing construction from Space constructions.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void DeleteConstruction(
	MEPBuildingConstruction pCurrentConstruction
)
Visual Basic
Public Sub DeleteConstruction ( _
	pCurrentConstruction As MEPBuildingConstruction _
)
Visual C++
public:
void DeleteConstruction(
	MEPBuildingConstruction^ pCurrentConstruction
)
Parameters
pCurrentConstruction
Type: Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction
The Construction will be deleted.
See Also
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace